{"id": "DO_WE_HAVE_A_FREE_WILL_0", "text": "Non-Christians and Christians alike often give the same answer to difficult questions like these: Why did God allow sin in the first place? Why does God save some people and not others? Why does God send people to hell? Why can living like a Chris- tian be so frustrating? The immediate solution often suggested is simple: “free will.” To many people, it’s a satisfying answer: “Oh, that makes sense. Yeah, God does x because he has to preserve my free will. Yeah, OK. Next question.” I’d like to suggest that we re-think this important issue. The title of this short essay is a question: “Do We Have a Free Will?” That question may be jarring to you because it asks if something exists that most people assume exists. My short answer to that question is that it depends on what you mean by “free.” The longer answer is the rest of this essay. We should study “free will” because it is theologically significant and because many people assume a particular definition of “free will” that is incorrect. Studying “free will” is challenging because it is not defined in Scripture. Further, it is complex because it connects to many other larger theological issues; it intersects with philosophy, historical theology, and systematic theology.", "source": "Do We Have a Free Will", "author": "Andy Naselli", "structure_path": [], "chunk_type": "paragraph", "chunk_index": 0, "processing_stage": "chunked", "processing_timestamp": "2025-11-06T15:10:25.973459"}
{"id": "DO_WE_HAVE_A_FREE_WILL_1", "text": "We should start by learning the standard terminology associated with the “free will” debate. 1. Will means the function of choosing. 2. Constraining causes force people to act against their will. For example, a person being robbed at gunpoint is constrained in this sense. Non-constraining causes do not force people to act against their will but are sufficient to cause an action. For example, if you have a fear of heights, you probably will not want to walk on the edge of a tall building’s roof; that fear is a non-constraining cause. 3. Indeterminism holds that genuinely free acts are not causally determined. Determinism holds that everything is causally determined (i.e., that prior events and conditions necessitate every event). 4. Incompatibilism holds that determinism and human freedom are incompatible; it rejects determinism and affirms human freedom. Compatibilism holds that determinism and human freedom are compatible. 5. Libertarian free will is the ability either to do something or not. Free agency is the ability to do whatever a person wants to do (apart from constraining causes). This difference is not a small one. For example, do non-Christians have the inherent ability either to choose to trust Christ or not? Is such a decision ulti- mately dependent on their will? 6. God’ s general sovereignty holds that God is in charge of everything without controlling everything. God’ s specific sovereignty holds that God ordains eve- rything and that he controls everything to accomplish his purposes.", "source": "Do We Have a Free Will", "author": "Andy Naselli", "structure_path": ["What is 'free will'?"], "chunk_type": "paragraph", "chunk_index": 1, "processing_stage": "chunked", "processing_timestamp": "2025-11-06T15:10:25.973480"}
{"id": "DO_WE_HAVE_A_FREE_WILL_2", "text": "1. The Bible never says that humans are free in the sense that they are autonomously able to make de- cisions that are not caused by anything. Libertarian free will is often merely assumed based on common-sense experience but not proved. 2. God is absolutely sovereign. He “works all things according to the counsel of his will” (Ephesians 1:11). He does whatever he wants, and no one can stop him (Psalm 115:3; Daniel 4:34–35). 3. Humans are morally responsible, which requires that they be free. There is no biblical reason that God cannot cause real human choices. The Bible grounds human accountability in God’s authority as our creator and judge, not in libertarian free will. 4. Both (1) God’s absolute sovereignty and (2) human freedom and responsibility are simultaneously true. Here are just a few of many passages in which both elements are present without any hint of contradiction. “The heart of man plans his way, but the LORD establishes his steps. . . . The lot is cast into the lap, but its every decision is from the LORD” (Proverbs 16:9, 33). “This Jesus, delivered up according to the definite plan and foreknowledge of God, you crucified and killed by the hands of lawless men” (Acts 2:23). “For truly in this city there were gathered together against your holy servant Jesus, whom you anointed, both Herod and Pontius Pilate, along with the Gentiles and the peoples of Israel, to do whatever your hand and your plan had predestined to take place” (Acts 4:27– 28). 5. The Bible condemns some people for acts not done with a libertarian free will. For example, Judas Iscariot was destined to betray Jesus, which means that he did not have the ability either to do it or not.", "source": "Do We Have a Free Will", "author": "Andy Naselli", "structure_path": ["What are biblical and theological reasons for compatibilism and against incompatibilism?"], "chunk_type": "paragraph", "chunk_index": 2, "processing_stage": "chunked", "processing_timestamp": "2025-11-06T15:10:25.973491"}
{"id": "DO_WE_HAVE_A_FREE_WILL_3", "text": "6. God is omniscient (e.g., he predicts future events). John Feinberg observes, “If indeterminism is correct, I do not see how God can be said to foreknow the future. If God actually knows what will (not just might) occur in the future, the future must be set and some sense of determinism applies. God’s foreknowledge is not the cause of the future, but it guarantees that what God knows must occur, regardless of how it is brought about” (“God Ordains All Things,” in Predestination and Free Will: Four Views of Divine Sovereignty and Human Freedom [ed. David Basinger and Randall Basinger; Downers Grove: IVP, 1986], 33– 34). 7. God breathed out Scripture through humans without violating their personalities. The way that God inspired the Bible requires compatibilism. 8. God enables Christians to persevere: Christians work because God works (cf. Philippians 2:12– 13). Indeterminism would mean that Christians can re- ject Christ and lose their salvation, but the Bible teaches that all genuine Christians are eternally secure and will persevere to the end by God’s grace. 9. God himself does not have a free will in the libertarian sense. Can God sin? If not, then he does not have a libertarian free will, and thus a libertarian free will is not necessary for a person to be genuinely free. 10. God’s people do not have free wills in heaven in the libertarian sense. Will God’s people be able to sin in heaven? If not, then they will not have a libertarian free will, and thus a libertarian free will is not necessary for people to be genuinely free.", "source": "Do We Have a Free Will", "author": "Andy Naselli", "structure_path": ["What are biblical and theological reasons for compatibilism and against incompatibilism?"], "chunk_type": "paragraph", "chunk_index": 3, "processing_stage": "chunked", "processing_timestamp": "2025-11-06T15:10:25.973499"}
{"id": "DO_WE_HAVE_A_FREE_WILL_4", "text": "Incompatibilism as Held by Many Arminians: Definition: Determinism and human freedom are incompatible. Determinism: Affirms indeterminism; rejects determinism. Human Freedom: Affirms libertarian free will. God's Sovereignty: Affirms God's general sovereignty. Compatibilism as Held by Calvinists: Definition: Determinism and human freedom are compatible. Determinism: Affirms determinism; rejects indeterminism and fatalism. Human Freedom: Affirms free agency. God's Sovereignty: Affirms God's specific sovereignty.", "source": "Do We Have a Free Will", "author": "Andy Naselli", "structure_path": ["What are biblical and theological reasons for compatibilism and against incompatibilism?"], "chunk_type": "paragraph", "chunk_index": 4, "processing_stage": "chunked", "processing_timestamp": "2025-11-06T15:29:56.824764"}
{"id": "DO_WE_HAVE_A_FREE_WILL_5", "text": "Short answer: No. When addressing this hugely difficult question, it is helpful to consider the following: 1. God is not the author or agent of evil, and he is not culpable for evil. 2. Satan is not God’s equal opposite (i.e., a God-versus-Satan dualism). 3. God, who accomplishes all things according to the counsel of his will, ordained that sin would enter his universe. (See the short essay in this series entitled “How Could a Good God Allow Suffering and Evil?”) God sovereignly works through secondary causes (such as humans) such that he is not culpable for evil but the secondary causes are. 4. Satan and then Adam and Eve sinned because they wanted to sin, and they are morally responsible to God for it. (The ability of humans to sin has four historical stages. First, Adam and Eve were initially able to sin. Second, after their fall, all unregenerate humans [i.e., those who are spiritually dead] are not able not to sin. Third, regenerate humans [i.e., those whom God has given spiritual life] are able not to sin. Fourth, glorified regenerate humans are not able to sin.) 5. Tension remains because compatibilists cannot explain exactly how God can ordain all things without being the author or agent of evil. It is at places like that that your head will start spinning if you try to put all the puzzle pieces together (we don’t have all the pieces!). Rather than deny explicit statements of Scripture that support compatibilism, a far better option is to acknowledge that this is a mystery that we finite and fallen humans simply cannot comprehend exhaustively. 6. There is no easy answer to explaining why God ordained the origin of sin in the first place. John Piper offers a helpful pastoral perspective in Spectacular Sins and Their Global Purpose in the Glory of Christ (Wheaton: Crossway, 2008). Why doesn’t God simply wipe out Satan? Piper concludes, “The ultimate answer... is that ‘all things were created through [Christ] and for [Christ]’ (Col. 1:16). God foresaw all that Satan would do if he created Satan and permitted him to rebel. In choosing to create him, he was choosing to fold all of that evil into his purpose for creation. That purpose for creation was the glory of his Son. All things, including Satan and all his followers, were created with this in view” (p. 48).", "source": "Do We Have a Free Will", "author": "Andy Naselli", "structure_path": ["Is libertarian free will the reason for the origin of sin?"], "chunk_type": "paragraph", "chunk_index": 5, "processing_stage": "chunked", "processing_timestamp": "2025-11-06T15:10:25.973508"}
{"id": "DO_WE_HAVE_A_FREE_WILL_6", "text": "Conversion consists of turning from sin (i.e., repentance) and to God (i.e., faith). Why do people convert from being non-Christians and become Christians? Is it ultimately because of their libertarian free wills? Or is it ultimately because of God? We do what we do because we want to do it (as long as we are not constrained), but we are not always able to do something or not (i.e., we do not always have the inherent ability to choose between options). Non-Christians do what they want to do, and they will never want to come to Christ as their master unless God first changes their “wanter.” Here’s an analogy: if a person is locked in a room but doesn’t want to get out, then even though he can’t get out, he is not there against his will. 1. Total Depravity. Unbelievers are totally depraved in the sense that depravity affects their entire being (Genesis 6:5; Ecclesiastes 7:20; 9:3; Isaiah 1:6; 64:6; Jeremiah 1323; 17:9; Romans 1:18–3:20, 23; James 3:2; 1 John 1:8, 10) including the mind (Romans 8:5–8; 1 Corinthians 2:14; Titus 1:15), body (Romans 8:10; Ephesians 4:17–19), and will (John 8:34). 2. Total Inability. Total depravity describes the human condition, and total inability describes the result of that condition (John 1:13; Ephesians 4:18 and Ezekiel 36:26; 2 Timothy 2:26; Romans 6:17, 20; 8:7–8; 2 Corinthians 4:4). Unregenerate humans are incapable of obeying the gospel (Matthew 7:18; John 8:43–44; 14:17; Romans 8:7– 8; 1 Corinthians 2:14). 3. Regeneration. Conversion is entirely a work of God (John 6:37, 44, 65; James 1:18). Re- generation transforms a human’s will and enables a person to come willingly to Christ. Regeneration is the act whereby God through the Holy Spirit by means of his word instantaneously imparts spiritual life to the spiritually dead (John 1:13; Titus 3:5; 1 Peter 1:23; James 1:18). It is a spiritual resurrection (Ephesians 2:1–6; Colossians 2:13), birth (John 3:3– 8), and creation (2 Corinthians 5:17). 4. Human Responsibility. This does not mean, however, that humans are not responsible to obey the gospel because God may command humans to do what they cannot do by themselves (cf. Leviticus 18:5 with Galatians 3:12). Human inability and responsibility are mysteriously compatible. 5. Evangelism and Prayer. The God who ordains the ends also ordains the means, and evan- gelism and prayer are God-ordained means to God-ordained ends. J. I. Packer argues that you already “acknowledge that God is sovereign in salvation” because “you pray for the conversion of others” (Evangelism and the Sovereignty of God [Downers Grove: IVP, 1961], 14–15).", "source": "Do We Have a Free Will", "author": "Andy Naselli", "structure_path": ["Is libertarian free will the ultimate reason for conversion?"], "chunk_type": "paragraph", "chunk_index": 6, "processing_stage": "chunked", "processing_timestamp": "2025-11-06T15:10:25.973517"}
{"id": "DO_WE_HAVE_A_FREE_WILL_7", "text": "1. Praise God for sovereignly planning the universe and for flawlessly executing his plan. If you are a Christian, praise God for giving you spiritual life when you were spiritually dead and for giving you the gifts of repentance and faith. Praise God that a day is coming when God will consummate his plan and transform us so that we will never again want to de-god God but instead will always want to delight in the glorious God. 2. Recognize that other orthodox Christians who disagree with you on this issue are not the enemy! Although some Christian leaders have embraced what I think are errant views on free will, many of them have been godly men worthy of emulation (e.g., John Wesley). So disagreeing with them on this particular issue in no way questions their devotion to Christ. 3. Since it is unlikely that all living Christians will agree on the issue of free will, promote unity on this issue as much as possible. This does not involve overlooking important differences, but it does involve keeping such differences in perspective. 4. As in all areas of controversial doctrine, hold your view with humility. We are fallen and finite creatures who know such a small fraction of what there is to know (and we often can’t even remember the little bit we used to know!). So when you are discussing this issue with others who disagree with you (and even when talking about it with people who agree with you), ask God for grace to display humility in your words and attitude because “God opposes the proud but gives grace to the humble” (1 Peter 5:5).", "source": "Do We Have a Free Will", "author": "Andy Naselli", "structure_path": ["Concluding Applications on the Free-Will Debate"], "chunk_type": "paragraph", "chunk_index": 7, "processing_stage": "chunked", "processing_timestamp": "2025-11-06T15:10:25.973528"}